[
  {
    "id": 1,
    "img": "https://i.imgur.com/8V09mop.jpg",
    "name": "Dronegenix",
    "desc": "Dronegenix is a drone-selling website with responsive functionality for different device users.",
    "link": "https://dronegenix-react.web.app/",
    "github": "https://github.com/joydey100/dronegenix-client",
    "features": "Dronegenix is a drone-selling website with responsive functionality for different device users. Used one the most Popular React Framework - Material UI User can purchase drone after login with Email-Password Authentication and a Google Authentication system if the user is not logged in, will not be able to purchase any product After login, the user can buy the product, see his payment status and add a review to the websit Route in different pages without reloading. Admin can manage products, add a new product, manage all the user's orders, make a new admin, and change the user's order status Using MongoDB to store Data. and also with so many awesome functionality. ",
    "screenshots": [
      "https://imgur.com/1vD7XWW.jpg",
      "https://imgur.com/OUMSzQT.jpg",
      "https://imgur.com/l57Maze.jpg"
    ],
    "technology": [
      "React",
      "React Router DOM",
      "Firebase",
      "Heroku",
      "Node js",
      "Express js",
      "MongoDB",
      "Material UI",
      "Sweet Alert",
      "dotenv"
    ]
  },
  {
    "id": 2,
    "img": "https://imgur.com/B2rrZEp.jpg",
    "name": "Travelopro",
    "desc": "Travelopro is a travel based website, where user can book his favorite tour packages.",
    "link": "https://travelopro-react.web.app/",
    "github": "https://github.com/joydey100/travelopro-client",
    "features": "Travelopro is a travel based website, where user can book his favorite tour packages. User can route different pages without reloading. Responsive for different devices (e.g- Laptop, Tablet, Desktop etc.) User can book his tour package after login with Email-Password Authentication and a Google Authentication system. if the user is not logged in, will not be able to purchase any package. After Login, the user can book a package, manage all the user's orders, change payment status, delete his order and add a new package. Using MongoDB to store Data. and also with so many awesome functionality.",
    "screenshots": [
      "https://imgur.com/dLtHnXW.jpg",
      "https://imgur.com/cNx90Rt.jpg",
      "https://imgur.com/8MtziZe.jpg"
    ],
    "technology": [
      "React",
      "React Router DOM",
      "Firebase",
      "Heroku",
      "Node js",
      "Express js",
      "MongoDB",
      "React Bootstrap",
      "Sweet Alert",
      "dotenv"
    ]
  },
  {
    "id": 3,
    "img": "https://imgur.com/odge7hx.jpg",
    "name": "MediCare",
    "desc": "MediCare is a health-care related website with responsive functionality for different device users.",
    "link": "https://medicare-react-project.web.app/",
    "github": "https://github.com/joydey100/medicare",
    "features": "MediCare is a health-care related website with responsive functionality for different device users.  In Home Page, there are Navbar, Banner, Services, Specialist, FAQ and Footer Section  User can route different pages without reloading.  Used Private Routing System to make Sure about Privacy.  Used Authentication System with Email - Password Authentication System & Google Authentication System  Without Authentication - No one can Access About, Contact and Single Service Pages  For login, the User can choose either an Email-Password authentication system or a Google authentication system. After login, the user can see all the services and get a clear idea about the services  Optimize all the images for better browsing.",
    "screenshots": [
      "https://imgur.com/72vcbPR.jpg",
      "https://imgur.com/s2Mxd0n.jpg",
      "https://imgur.com/FpcJTj7.jpg"
    ],
    "technology": ["React", "React Router DOM", "Firebase", "React Bootstrap"]
  },
  {
    "id": 4,
    "img": "https://imgur.com/4WUZiOL.jpg",
    "name": "Corona Tracer",
    "desc": "This web application mainly based on the corona situation of Bangladesh. it was madewith Popular UI Library React JS.",
    "link": "https://joydey100.github.io/corona/",
    "github": "https://github.com/joydey100/corona",
    "features": "This web application mainly based on the corona situation of Bangladesh. it was made with Popular UI Library React JS. In this project, It will give information about the corona affected peoples number of the country, the situation of the country (How many people get well, how many are in a serious situation, etc). Users can also know the world's corona situation through this website.",
    "screenshots": ["https://imgur.com/dZyusgw.jpg"],
    "technology": ["React", "React Router DOM", "Netlify", "Bootstrap"]
  },
  {
    "id": 5,
    "img": "https://imgur.com/cHbLYrY.jpg",
    "name": "Food Network",
    "desc": "This is a restuarant website, where people can see the food items and clients review. Made with plain HTML, CSS and JavaScript",
    "link": "https://joydey100.github.io/food-network/",
    "github": "https://github.com/joydey100/food-network",
    "features": "This is a restuarant website, where people can see the food items and clients review. Made with plain HTML, CSS and JavaScript. It was my first porject for Programming Hero Course. The requirement was to built a responsive website within 1 days, with menu, bannar, food item and extra 2 section which should be relevent with this website",
    "screenshots": ["https://imgur.com/JE67wCv.jpg"],
    "technology": ["HTML", "CSS", "JavaScript", "Github"]
  },
  {
    "id": 6,
    "img": "https://imgur.com/zrQI0or.jpg",
    "name": "Elastic Studios",
    "desc": "This is a Photography website, made with plain HTML, CSS and JavaScript. User can see photographs, contact and book his package",
    "link": "https://elastic-studios.netlify.app/",
    "github": "https://github.com/joydey100/elastic-studios",
    "features": "This is a Photography website, made with plain HTML, CSS and JavaScript. User can see photographs, contact and book his package. To this make website I have got many challenges. The main challange for me to create those borders in home page for different section and inside of the section. I took inspiration from figma for UI and make it within 1 day",
    "screenshots": [
      "https://imgur.com/ZHHVawW.jpg"
    ],
    "technology": ["HTML", "CSS", "JavaScript", "Github"]
  }
]
